<template>
    <div style="padding: 20px;">
      <div>
        <h3>当前版本1.1.0</h3>
      </div>
      <h4>版本说明：</h4>
      <div>
        <h4>版本号1.1.0</h4>
        <div>
          <p>修复：</p>
          <p>1.搜狗五笔输入法无法连续输入多字</p>
        </div>
      </div>
      <div>
        <h4>版本号1.0.9</h4>
        <div>
          <p>修复：</p>
          <p>1.修复->修复批量上下架操作无反应</p>
          <p>2.直播管理-观看窗口：手动拖拽调整观看窗口的大小高度与宽度与富文本框的高度和高度重叠，或者按f11全屏时，会导致观看窗口抖动</p>
          <p>3.直播预览：当前选中的机位建议用红色或其他颜色标记，不然用户不知道当前选的是哪个机位</p>
          <p>4.到直播间结束时间，通过后台系统进行预览的用户（到点未退出）仍能观看机位的推流画面</p>
        </div>
      </div>
      <div>
        <h4>版本号1.0.8</h4>
        <div>
          <p>优化：</p>
          <p>1.增加名称输入前后空格判断</p>
        </div>
      </div>
      <div>
        <h4>版本号1.0.7</h4>
        <div>
          <p>修复：</p>
          <p>1.后台-推流地址管理：在中台删除设备，后台推流地址列表要多加一列“是否删除”去标记设备的删除状态</p>
        </div>
      </div>
      <div>
        <h4>版本号1.0.6</h4>
        <p>修复：</p>
        <p>1.修复分页显示错误</p>
      </div>
      <div>
        <p>版本号1.0.5</p>
        <p>修复：</p>
        <p>1.用户组管理：被使用的用户组增加删除、禁用置灰不能点击操作</p>
        <p>2.回放视频管理：回放记录下架后无法上架</p>
        <p>3.后台直播管理，批量操作报错</p>
      </div>
      <div>
        <p>版本号1.0.4</p>
        <p>修复：</p>
        <p>1.后台-回放视频管理：删除回放记录，刷新页面显示“已删除”的状态</p>
        <p>2.后台-回放视频管理：上下架状态的值显示错误：上架状态显示成了“在线”， 下架状态显示成了“离线</p>
      </div>
      <div>
        <p>版本号1.0.3</p>
        <p>修复：</p>
        <p>1.到直播间结束时间，通过后台系统进行预览的用户（到点未退出）仍能观看机位的推流画面</p>
        <p>2.频道详情：频道里面新建的直播间的直播状态显示为空，网络规则、有无密码等字段显示错误</p>
      </div>
      <div>
        <p>版本号1.0.2</p>
        <p>修复：</p>
        <p>1.预览时的机位分辨率应结合所选机位进行显示</p>
        <p>2.预览弹窗应只允许一个，点击其它直播间的【预览】时，弹窗内容替换为所点击的直播间内容</p>
      </div>
      <div>
        <p>版本号1.0.1</p>
        <p>修复：</p>
          <p>1.频道页面管理-修复发布用户未显示</p>
          <p>2.运维管理-观看服务器管理-修复删除重复节点后提示未消失</p>
          <p>3.后台直播间的【上下架】、【删除】逻辑保持与中台一致</p>
          <p>4.后台 listTranCodeSetting接口total数据返回有误</p>
      </div>
    </div>
</template>

<script>
    export default {
        name: "version"
    }
</script>

<style scoped>

</style>
