<template>
    <div>
      <h3>当前版本号1.1.6</h3>
      <div>
        <h4>版本号1.1.6</h4>
        <div>
          <p>修复：</p>
          <p>1.修改密码判断左右空格</p>
          <p>2.去除直播地址必填标志</p>
        </div>
      </div>
      <div>
        <h4>版本号1.1.5</h4>
        <div>
          <p>优化：</p>
          <p>1.优化：位置树节点样式优化，增删改查树节点实时刷新</p>
          <p>2.中台-新建直播间：创建直播间时重复点“创建”按钮可以重复提交</p>
        </div>
      </div>
      <div>
        <h4>版本号1.1.4</h4>
        <p>优化：</p>
        <p>1.位置树状结构高亮后背景颜色加深</p>
        <p>2.增加删除机位编辑机位提示</p>
        <p>3.设备管理删除设备操作优化</p>
        <p>增加：</p>
        <p>1.增加删除一级位置操作</p>
      </div>
      <div>
        <h4>版本号1.1.3</h4>
        <p>修复：</p>
        <p>1.增加名称输入前后空格判断</p>
        <p>2.修改密码提交按键对齐</p>
      </div>
      <div>
        <h4>版本号1.1.2</h4>
        <p>修复：</p>
        <p>1.新增位置时左右空格去除</p>
        <p>2.增加位置删除操作</p>
      </div>
      <div>
        <h4>版本号1.1.1</h4>
        <p>修改：</p>
        <p>1.屏蔽页面回放相关设置及操作</p>
      </div>
      <div>
        <h4>版本号1.1.0</h4>
        <p>修复：</p>
        <p>1.修复分页显示错误</p>
      </div>
      <div>
        <h4>版本号1.0.9</h4>
        <div>
          <p>修复：</p>
          <p>1.中台，导播设置，机位名称输入保存后所有的机位名称无法正常编辑修改</p>
        </div>
      </div>
      <div>
        <h4>版本号1.0.8</h4>
        <div>
          <p>修复：</p>
          <p>1.修复回放设置密码字段，password 改为originpassword</p>
        </div>
      </div>
      <div>
        <h4>版本号1.0.7</h4>
        <div>
          <p>修复：</p>
          <p>1. 中台，导播设置机位列表投放位置取值不正确</p>
          <p>2.中台，导播设置观看地址为空可正常保存，没有提示观看地址为必填项</p>
        </div>
      </div>
      <div>
        <h4>版本号1.0.6</h4>
        <div>
          <p>修复：</p>
          <p>1.修改部分文字描述</p>
          <p>2.修改导播设置-投放位置获取字段detailPositionName</p>
        </div>
      </div>
      <div>
        <h4>版本号1.0.5</h4>
        <div>
          <p>修复：</p>
          <p>1. 中台，导播设置，添加/编辑机位，未显示完整的投放位置</p>
          <p>2.中台-直播管理：上次直播时间为空时要显示“--”</p>
          <p>3.中台-直播管理：已下架的直播间应不能显示“直播设置”和“回放设置”按钮</p>
          <p>4.中台 ：频道下的直播 “下架”， 未显示删除按钮 </p>
          <p>5.中台频道管理，编辑频道后无法显示图片</p>
          <p>6.中台-直播管理：未绑定机位的直播间，直播状态中，观看按钮点击无反应</p>
        </div>
      </div>
      <div>
        <h4>版本号1.0.4</h4>
        <div>
          <p>修复：</p>
          <p>1.中台-设备管理：删除设备窗口，列表为空时 ，“全部解绑并删除”按钮应不允许点击</p>
          <p>2.中台-直播管理-回放设置：保存回放设置后，再点开设置窗口，没有显示上次所选的回放视频名称</p>
          <p>3.删除按钮贴的太紧</p>
          <p>4.	中台-直播管理-回放设置：回放设置结束时间<=回放开始时间，仍可以保存成功，应不可提交并提示“回放结束时间不能早于开始时间”</p>
          <p>5.中台-VR直播管理-直播设置：直播间副标题的字符限制错误，应28个字符以内，不是“3-28个字符”</p>
        </div>
      </div>
      <div>
        <h4>版本号1.0.3</h4>
        <div>
          <p>优化：</p>
          <p>1.中台-VR直播-直播管理：点一键下播按钮，“下播成功”提示的样式要改成绿色背景</p>
          <p>2.中台-VR直播管理-直播设置：直播结束时间<=直播开始时间，仍可以保存成功，应不允许提交并提示直播结束时间不能早于开始时间</p>
          <p>3.中台-VR直播-频道管理：上传频道图片的高度尺寸没有实现最小值500的限制，高度的限制应改为：500>=高度<=900​</p>
          <p>修复：</p>
          <p>1.设备管理，分辨率显示错误</p>
        </div>
      </div>

      <div>
        <h4>版本号1.0.2</h4>
        <div>
          <p>修复：</p>
          <p>1.中台-频道管理：新建频道页面的标题“新建应用”应改为“新建频道 ”</p>
          <p>2.中台-频道管理：在后台对频道做下架操作后，中台频道列表的“创建时间”和“修改时间”取值调反了</p>
          <p>3.中台-VR直播-直播管理：新建直播页面应补上“返回”按钮</p>
          <p>4.中台-VR直播-直播管理:停止回放按钮点击无响应</p>
          <p>5.导播设置：观看地址未根据后端返回数据进行勾选显示</p>
          <p>6. 直播管理与频道管理数据混乱</p>
          <p>7.直播管理接口调用传参有误</p>
          <p>8. 中台-VR直播-直播管理：列表多了“直播分辨率”的列</p>
          <p>9.对直播间进行【下架】操作，后端报错</p>
        </div>
      </div>
      <div>
        <h4>版本号1.0.1</h4>
        <div>
          <p>修复：</p>
          <p>1.去除直播设置回放设置 否 选择</p>
          <p>2.去除直播观看地址链路重复</p>
          <p>3.修改机位设置文字</p>
          <p>4.新增首次登陆修改密码页面</p>
          <p>5.增加修改密码加密</p>
          <p>6.中台-VR直播回放：回放列表的回放创建时间空，应显示回放记录的创建时间</p >
        </div>
      </div>
    </div>
</template>

<script>
    export default {
        name: "version"
    }
</script>

<style scoped>

</style>
